# 2) კომენტარის სახით ჩამოწერეთ ყველა სტრინგის და სიის ფუნქცია რაც ვისწავლეთ და თითოეულს მიუწერეთ თუ რა დანიშნულება აქვს.                (ყველაფერი არის აღებული გაკვეთილიდან)

#1) .lower() -> ამ ფუნქციას მოცემული სტრინგი გადაჰყავს ლოვერქეის (პატარა) ასოებად.
name = "Lika"
new_name = name.lower()
print(new_name)

#2).upper() -> ეს ფუნქცია მთლიანად სტრინგს გადაქცევს უფერქეის (დიდ) ასოებად.
academy = "goa"
print(academy.upper())

#3) .capitalize() -> ეს ფუნქცია მომდევნო სტრინგის პირველ ასოს ადიდებს, ხოლო ყველა დანარჩენს აპატარავებს.
artist = "rAdiOhead"
new_artist = artist.capitalize()
print(new_artist)

#4) Python-ში find() მეთოდი გამოიყენება სტრიქონებთან ერთად სხვა სტრიქონში ქვესტრინგის მოსაძებნად. ის გიჩვენებთ ინდექსს (პოზიციას), სადაც პირველად ჩნდება ეს ქვესტრიქონი. თუ ქვესტრიქონი ვერ მოიძებნა, ის აბრუნებს -1-ს.
text = "Hello, Greater Good™!"
ZD = text.find("Good")
print(ZD)

#5) append() ამატებს ერთ ელემენტს სიის ბოლოს. ის ცვლის თავდაპირველ სიას ადგილზე.
rizz_list = ["GOA", "Aura", "Loyalty"]
rizz_list.append("Discipline")
print(rizz_list)

#6) insert() ამატებს პუნქტს სიაში კონკრეტულ ინდექსზე. განსხვავებით append()-ისგან, რომელიც ყოველთვის ამატებს ბოლოს, insert() გაძლევთ სრულ კონტროლს იმაზე, თუ სად მიდის ელემენტი.
BECOME_CHAD = ["Aur", "GOA", "Loyalty"]
BECOME_CHAD.insert(1, "Discipline")
print(BECOME_CHAD)



