#4)შექმენით სია რომელშიც იქნება 10 ელემენტი, შემდეგ მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ინდექსზე მდგომი ელემენტი ამოაგდეთ სიიდან.





#ელემენტები   1      2        3        4       5        6          7      8        9         10
#ინდქსები      0       1      2        3        4       5         6       7         8        9        
ხილი=[    "ვაშლი","ბანანი","მსხალი","წაბლი","ბალი","ალუბალი","ატამი","მანგო", "ანანასი" "ყურძენი"]
print(ხილი)#ორიგინალი სია

რიცხვი= input  ("შემოითანეთ ერთი რიჩხვი:")
ხილი.pop(რიცხვი)#ამოგდება
print(რიცხვი)#სია