# 5)იგივე რამ გააკეთეთ ოღონდ უკვე or-ის გამოყენებით მაგალითად True or False და კომენტარში ახსენით თუ რატომ არის საბოლოო პასუხი True და კიდე ბევრი მაგალითი გააკეთეთ კომენტარით ახსენით


#or ოპერატორი
print( True or False)#False არის დამაკმაყოფილებელი მხოლოდ ერთი მაგრამ ეს არ არის საკმარისი
print( False or True)#False არის დამაკმაყოფილებელი მხოლოდ ერთი მაგრამ ეს არ არის საკმარისი
print( False or False)#False ორივე ნეგატივია ორივე არა დამაკმაყოფილებელია
print( True or True)#true არის დამაკმაყოფილებელი რადგან ორივე პოზიტივზეა.






