# 4)and-ის გამოყენებით გააკეთეთ  boolean მაგალითები მაგალითად True and False და ასე შემდეგ კომენტარში ახსენით თუ რატო გამოდის ეგეთი  შედეგი როგორიცაა False

#and ოპერატორი
print( True and False)#False არის დამაკმაყოფილებელი მხოლოდ ერთი მაგრამ ეს არ არის საკმარისი
print( False and True)#False არის დამაკმაყოფილებელი მხოლოდ ერთი მაგრამ ეს არ არის საკმარისი
print( False and False)#False ორივე ნეგატივია ორივე არა დამაკმაყოფილებელია
print( True and True)#true არის დამაკმაყოფილებელი რადგან ორივე პოზიტივზეა.


