#3 შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის.

credit = 100 #კრედიტ პირველი.
#კრედიტ პირველი არის დაწერილი პატარა ასოებით და იგი აღნიშნავს 100-ს ტერმინალში.



CREDIT = 256 #კრედიტ მეორე.
#ეს არის კრედიტ ორი რომელიც არის დაწერილი დიდი ასოებით და გინდაც ჰგავს კრედით პირველს მაგრამ მათ გამოთქმის გარდა საერთო არაფერი არ აქვს რადგან იგი აღნიშნავს სულ სხვა რამეს.


#პირველი კრედიტი არის მონაცემთა ისეთი ნაწილი რომელიც კოდის მიხედვის დროს შეიძლება შეიცვალოს.
#კრედიტი ორი არის მუდმივი მონაცემი რომელიც კოდის დროს არ შეიცვლება.























