#1. შექმენით ცვლადი სადაც მიანიჭებთ თქვენს სახელს ეს ცვლადი უნდა დააკომენტაროთ და დაპრინტოთ და ახსნათ კომენტარებით რატომ ვერ გამოიტანს ცვლადის მნიშვნელობას.

zura = ("ZD") # შევქმენი ცვლადი ჩემს სახელს მიმართ.

print("zura") # ამ შემთხევევაში ტერმინალს გამოაქვს მოცემული სახელი მაგრამ იგი არ იყენებს ცვლადს რადგან ის მხოლოდ აკეთებს რასაც ვეუბნები. (ეს არ არის ის zura არდგან მე მჭირდება რომ მან დაპრინტოს zura ტერმინალიდან.)

print(zura) # ახლა კი ტერმინალი კითხულობს კოდს და პრინტავს ზურას რომელიც არის ცვლად რადგან ის არ არის ბრჭყალებში.


#როდესაც ჩვენ გაუშვებთ კოდს მაშინ ჯერ გამოვა თვითონ ცვლადის სახელი რადგან იგი პირველი მივუთითეთ ტერმინალში და ჩავსვით ბრჭყალებში და მხოლოდ მაგის მერე თვითონ ცვლადის ნამდვილი აღნიშნულება.






