#1 input-ი არის კოდის ნაწილი რომელიც შედის სისტემაში და ამით იწვევს output-ს რომელსაც input-ის საპირისპირო ძმა რომელსაც გამოაქვს მიმართული ბრძანება ნამდვილ მსოფლიოში.

#2 მაგალითი:მოდი წარმოვიდგინოთ მე ველაპარაკები ჩემ ძმას ტელეფონზე და მე რამე ვუთხარ მას ტელეფონ ამას მიიღებს როგორც output-ს რადგან ჩემი ხმა შიგ შედის და ჩემი ძმის ტელეფონი კი აღიქვავს ამას როგორც output-ს რადგან ის ხმა მის ტელეფონიდან გამოდის.

#სიტყვების გარჩევა
#input-ი     in-შიგნით put-ჩადება    input-შიგნითჩადება
#output-ი   out-გარეთ                output-გარეთჩადება