# 1)განიხილეთ ეს კოდი:

def word_len(sentance): # შევქმენით ფუნქცია რომელიც დაითვლის სიტყვის სიგრძეს წინადადებაში.
    result = []  # შევქმენით რეზულტატი ცვლადი
    words = "" # შევქმენიც ცვლადი სიტყვები

    for i in sentance:    # გადაუარეთ არგუმენტს ფორ ი რეინჯით
        if i != " ":     # თუ ი არ არის სიცარიელე მაშინ...
            words += i  # მაშინ  დავამატოთ სიმბოლო მიმდინარე სიტყვას
        else:          # თუ პირველნაირად არ გამოვა მაშინ ასე იქნება
            result.append(words + str(len(words))) # .append- ის დახმარებით ვამატებთ სიტყვის(/words) სიგრძეს(/len) სტრინგულ ფორმაში.(/str)
            words = "" #მგონი (თუ არ მეშლება) განვანახლეთ ცვლადი სიტყვები.

    result.append(words + str(len(words)))#.append- ის დახმარებით ვამატებთ სიტყვის(/words) სიგრძეს(/len) სტრინგულ ფორმაში.(/str)
    print(result) # დავპრინტოთ რეზულტატი

word_len("Hello how are you")    # გამოვიძახეთ ჩვენი კოდი

word_len("მე მიყვარს ვჭამო გოგრა კიტრი ხაჭაპური ხინკალი საზამთრო და შემწვარი იხვი") # გამოვიძახეთ ჩვენი კოდი